Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སྤྱོད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་སྤྱོད་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་པའི་དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་འཕེལ་བ་ནི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཡོངས་སུ་ཉམ་པའི་གནས་མེད་སྐབས་མེད་དེ་དེ་ནི་གནས་མ་ཡིན་ནོ།
en: There is no chance, no possibility.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་བཤད་པའི་ཚེ། བཅོམ་ལྡན་འདས་ཀྱིས་འཁོར་བཞི་དང་། ལྷ་དང་མི་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་།
en: When this perfection of wisdom was being explained, the Blessed One manifested his miraculous power in the presence of the four assemblies [of practitioners] and the gods, human beings, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas who were there, {Ki.

source: མིའམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དེ་ལྟར་འཁོད་པ་རྣམས་ཀྱི་མདུན་དུ་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་གང་མངོན་པར་འདུ་མཛད་པས། ཐམས་ཅད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པ་འཁོར་རྒྱ་མཚོ་ལྟ་བུ་འཁྲུག་པ་མེད་པ་ཀུན་ཀྱང་དགྲ་བཅོམ་པ་ཟག་པ་ཟད་པ། ཉོན་མོངས་པ་མེད་པ་དབང་དུ་གྱུར་པ། སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཤེས་རབ་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། ཅང་ཤེས་པ། གླང་པོ་ཆེན་པོ་བྱ་བ་བྱས་པ།
en: V: 75} such that they all saw the tathāgata, arhat, completely awakened Buddha Akṣobhya, surrounded and attended on all sides by an entourage entirely comprising bodhisattva great beings and a community of monks that resembled an unagitated ocean.

source: བྱེད་པ་བྱས་པ། ཁུར་བོར་བ། རང་གི་དོན་རྗེས་སུ་ཐོབ་པ། སྲིད་པར་སྦྱོར་བ་ཡོངས་སུ་ཟད་པ་བཀའ་ཡང་དག་པས་སེམས་ཤིན་ཏུ་རྣམ་པར་གྲོལ་བ། སེམས་ཐམས་ཅད་ལ་དབང་དམ་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ཐོབ་པ་ཤ་སྟག་གི །
en: All of them were arhats who had attained the cessation of contaminants, and were without afflicted mental states, fully controlled, their minds well liberated, their wisdom well liberated, thoroughbreds, mighty nāgas, their tasks accomplished, their work completed, their burdens relinquished, their own objectives fulfilled, the fetters binding them to the rebirth process completely severed, their minds well liberated by means of genuine teaching, absolutely supreme above all beings in their perfection of all mental faculties.

source: དགེ་སློང་གི་དགེ་འདུན་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤ་སྟག་གིས་ཀུན་ནས་བསྐོར་ཅིང་མདུན་དུ་བདར་བ་མཐོང་བར་གྱུར་པ་དེ་ལྟ་བུའི་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་མངོན་པར་འདུ་མཛད་དོ། །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་དེ་ཕྱིར་བརྟུལ་བར་གྱུར་ཏེ། རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་དེ་ཕྱིར་བརྟུལ་བར་གྱུར་ནས། འཁོར་བཞི་པོ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པ་ཡང་མ་མཐོང་།
en: Then the Blessed One withdrew the miraculous power that he had manifested, so that those four assemblies no longer saw the tathāgata, arhat, completely awakened Buddha Akṣobhya.

source: གང་ཟག་ཉན་ཐོས་སམ། བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་དེ་དག་ཀྱང་མ་མཐོང་ངོ་།
en: They no longer saw those individual śrāvakas or those followers of the vehicle of the bodhisattvas.

source: །དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པའི་སངས་རྒྱས་དེའི་ཞིང་ཡང་མ་མཐོང་ངོ་།
en: They no longer saw the field of that tathāgata, arhat, completely awakened Buddha Akṣobhya.

source: །སངས་རྒྱས་ལ་སྩོགས་པ་དགེ་སློང་གི་དགེ་འདུན་ཡང་མིག་ལམ་ན་མི་སྣང་བར་གྱུར་ཏོ།
en: The community of monks, headed by the Buddha, no longer appeared within the range of their vision.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས། རྫུ་འཕྲུལ་མངོན་པར་འདུ་མཛད་པ་ཕྱིར་བརྟུལ་བ་མཛད་པས། དེའི་ཕྱིར་དེ་དག་གིས་མི་མཐོང་བར་གྱུར་ཏོ།
en: If one were to ask why, they did not see them because the tathāgata, arhat, completely awakened Buddha Akṣobhya had withdrawn the miraculous power that he had [previously] manifested.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་བཀའ་སྩལ་པ། དགའ་བོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་མི་འཁྲུགས་པའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་དང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པ་དང་། དགེ་སློང་གི་དགེ་འདུན་དང་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་མཐོང་ངམ། གསོལ་པ།
en: Then the Blessed One asked the venerable Ānanda, “Do you now see the field of the Tathāgata Akṣobhya—the tathāgata, arhat, completely awakened Buddha Akṣobhya, the community of monks, and the community of bodhisattvas?” “

source: བཅོམ་ལྡན་འདས་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ཡང་མ་མཐོང་།
en: Blessed Lord, I no longer see that buddhafield.

source: དེ་བཞིན་གཤེགས་པ་དེ་ཡང་མ་མཐོང་།
en: I no longer see that tathāgata.

source: དགེ་སློང་གི་དགེ་འདུན་དེ་ཡང་མ་མཐོང་།
en: I no longer see that community of monks.

source: བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དེ་ཡང་མ་མཐོང་སྟེ།
en: I no longer see that community of bodhisattvas.

source: མིག་ལམ་དུ་ཡང་མི་གདའོ།
en: It is not within the range of my vision.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགའ་བོ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་མིག་ལམ་དུ་སྣང་བ་མ་ཡིན་ཏེ།
en: In the same way, Ānanda,” continued the Blessed One, “there are no phenomena that appear within the range of vision.

source: ཆོས་ལ་ཆོས་སྣང་བར་མི་འགྱུར།
en: There is nothing that appears to anything.

source: ཆོས་ཀྱིས་ཆོས་མི་མཐོང་།
en: There is nothing that sees anything.

source: ཆོས་ཀྱིས་ཆོས་མི་ཤེས་སོ།
en: There is nothing that knows anything.

source: །དགའ་བོ་ཇི་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མི་འཁྲུགས་པ་དང་། ཉན་ཐོས་དེ་དག་དང་། གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་དེ་དག་དང་། སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་མིག་ལམ་དུ་སྣང་བར་མ་གྱུར་པ་དེ་བཞིན་དུ་ཆོས་ཐམས་ཅད་ཀྱང་མིག་ལམ་དུ་སྣང་བ་མ་ཡིན་ཏེ།
en: Ānanda, just as the tathāgata, arhat, completely awakened Buddha Akṣobhya, those śrāvakas, those followers of the vehicle of the bodhisattvas, and those buddhafields do not appear within the range of vision, in the same way there is nothing at all that appears within the range of vision.

source: །དགའ་བོ་ཆོས་ཐམས་ཅད་ནི་ཤེས་པ་མེད་པ། མཐོང་བ་མེད་པ། བྱེད་པ་མེད་པ། བྱ་བ་ལ་མཐུ་མེད་པ་ཤ་སྟག་སྟེ།
en: Ānanda, all phenomena are unknown, unseen, inactive, and absolutely incapable of action.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགའ་བོ་ཆོས་ཐམས་ཅད་ནི་ནམ་མཁའ་ལྟར་བྱེད་པ་མེད་པས། བྱེད་པ་མེད་ཅིང་འཛིན་པ་མེད་པའོ།
en: If you ask why, all phenomena are inactive and ungraspable because they are like space, which is inactive. “

source: །དགའ་བོ་ཆོས་ཐམས་ཅད་ནི་སྒྱུ་མའི་སྐྱེས་བུ་ལྟ་བུ་སྟེ། བསམ་གྱིས་མི་ཁྱབ་པའོ།
en: Ānanda, all phenomena are inconceivable, like an illusory man.

source: །དགའ་བོ་ཆོས་ཐམས་ཅད་ནི་སེམས་དང་བྲལ་ཞིང་རྣམ་པར་བསྒྲུབས་པས་སོ་སོར་གནས་པའི་མཚན་ཉིད་མེད་དེ་སྙིང་པོ་མེད་པའི་ཕྱིར་ཚོར་བ་མེད་པའོ།
en: Ānanda, all phenomena are without thought and unknown because they lack defining characteristics established through fabrication and they are essenceless.

source: །དེ་ལྟར་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་སྟེ། ཆོས་གང་ལ་ཡང་མངོན་པར་ཆགས་པ་མེད་དོ།
en: Bodhisattva great beings who practice accordingly practice the perfection of wisdom, and they are fixated on nothing at all. {

source: །དགའ་བོ་དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སློབ་པ་སྟེ།
en: Ki.V: 76} “Ānanda, bodhisattva great beings who train in that manner train in the perfection of wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕ་རོལ་དུ་ཕྱིན་པ་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་བྱ་བར་འདོད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བྱའོ། །དེ་ལྟར་སློབ་པ་ནི་རབ་ཅེས་བྱའོ། །གཙོ་བོ་ཞེས་བྱའོ། །མཆོག་ཅེས་བྱའོ། །དམ་པ་ཞེས་བྱའོ།
en: Bodhisattva great beings who wish to complete all the perfections should train in the perfection of wisdom.

source: །མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱའོ། །འཇིག་རྟེན་ཐམས་ཅད་ལ་ཕན་པ། འཇིག་རྟེན་ཐམས་ཅད་ལ་བདེ་བ།
en: They are intent on the benefit of all worlds and the happiness of all worlds.

source: མགོན་མེད་པ་རྣམས་ཀྱི་མགོན་དུ་གྱུར་པ། སངས་རྒྱས་ཀྱིས་གནང་བ། སངས་རྒྱས་ཀྱིས་བསྔགས་པ་སྟེ།
en: They are protectors of the unprotected, favored by the buddhas and praised by the buddhas.

source: དེ་ལ་གནས་ཤིང་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ཕྱག་གཡས་པས་གྱེན་དུ་བཏེག་ཅིང་ཕྱིར་གཞོག་ཀྱང་སེམས་ཅན་དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་བཏེག་གོ་ཞེས་བྱ་བ་དང་། བཞག་གོ་ཞེས་བྱ་བར་མི་ཤེས་པའོ།
en: Even if the tathāgatas, arhats, completely awakened buddhas were to raise up this world system of the great trichiliocosm with their right hand and then let it drop, those beings would not know that this world system of the great trichiliocosm was being raised up, or that it was being dropped.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགའ་བོ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དེ་ཉིད་ལ་བསླབས་པས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ཆོས་རྣམས་ལ་ཐོགས་པ་མི་མངའ་བའི་ཡེ་ཤེས་གཟིགས་པ་གྲུབ་པ་ཡིན་ཏེ།
en: If you ask why, Ānanda, through having trained in this very perfection of wisdom, the lord buddhas indeed attain the vision of wisdom that is unimpeded with respect to phenomena of the past, future, and present.

source: དགའ་བོ་བསླབ་པ་གང་ཇི་སྙེད་ཅིག་ཡོད་པའི་བསླབ་པ་ཐམས་ཅད་ཀྱི་ནང་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བསླབ་པ་ནི་རབ་ཅེས་བྱའོ། །གཙོ་བོ་ཞེས་བྱའོ། །མཆོག་ཅེས་བྱའོ། །དམ་པ་ཞེས་བྱའོ། །ཕུལ་ཞེས་བྱའོ། །གྱ་ནོམ་པ་ཞེས་བྱའོ། །བླ་ན་མེད་པ་ཞེས་བྱའོ། །གོང་ན་མེད་པ་ཞེས་བྱའོ།
en: Ānanda, among all the trainings that there are, the training in the perfection of wisdom is said to be the best, said to be foremost, said to be supreme, said to be sacred, said to be perfect, said to be sublime, said to be unsurpassed, said to be highest, said to be unequaled, and said to be equal to the unequaled. “

source: །མཉམ་པ་མེད་པ་ཞེས་བྱའོ། །མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱའོ། །དགའ་བོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་ཚད་གཟུང་བ་འམ། མཐའ་བཙལ་བར་འདོད་པ་དེ་ནི། ནམ་མཁའ་ལ་ཚད་གཟུང་བ་དང་མཐའ་བཙལ་བར་འདོད་དུ་ཟད་དོ།
en: Ānanda, to wish to grasp the measure or explore the limits of the perfection of wisdom would simply be to wish to grasp the measure or explore the limits of space.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཚད་མེད་པ་སྟེ།
en: If you ask why, Ānanda, the perfection of wisdom is immeasurable.

source: དགའ་བོ་ངས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཚད་དུ་བསྟན་པ་མེད་དོ།
en: Ānanda, I have not taught that the perfection of wisdom can be measured.

source: །མིང་མང་པོ་དང་། ཚིག་མང་པོ་དང་། འབྲུ་མང་པོ་ལ་ནི་ཚད་ཡོད་ཀྱི། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ནི་ཚད་མེད་དོ།
en: Clusters of nouns, clusters of words, and clusters of syllables are measurable, but the perfection of wisdom is immeasurable.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཚད་མ་མཆིས་པ་ལགས།
en: Blessed Lord, why is the perfection of wisdom immeasurable?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགའ་བོ་མི་ཟད་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཚད་མེད་དོ།
en: Ānanda,” replied the Blessed One, “the perfection of wisdom is immeasurable because it is inexhaustible.

source: །དགའ་བོ་དབེན་པའི་ཕྱིར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་ཚད་མེད་དོ།
en: Ānanda, the perfection of wisdom is immeasurable because it is void.

source: །དགའ་བོ་འདས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བྱུང་བ་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལས་བྱུང་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟད་པར་མ་གྱུར་ཏོ།
en: Ānanda, all the tathāgatas, arhats, completely awakened buddhas of the past have also originated from this same perfection of wisdom, and the perfection of wisdom has not been exhausted.

source: །དགའ་བོ་མ་འོངས་པའི་དུས་ཀྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་འབྱུང་བ་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལས་འབྱུང་སྟེ།
en: Ānanda, all the tathāgatas, arhats, completely awakened buddhas of the future will also originate from this same perfection of wisdom, and the perfection of wisdom will not be exhausted. {Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟད་པར་འགྱུར་བ་མེད་དོ། །དགའ་བོ་ད་ལྟར་ཕྱོགས་བཅུའི་འཇིག་རྟེན་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གང་ཇི་སྙེད་ཅིག་བཞུགས་ཤིང་འཚོ་སྐྱོང་བ་དང་། ཆོས་སྟོན་པའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ཉིད་ལས་བྱུང་སྟེ།
en: V: 77} Ānanda, all the tathāgatas, arhats, completely awakened buddhas who are alive at present, teaching the Dharma in the world systems of the ten directions, also originate from this same perfection of wisdom, and the perfection of wisdom is not being exhausted.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མ་ཟད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟད་པར་བྱ་བར་སེམས་པ་དེ་ནི་ནམ་མཁའ་ཟད་པར་བྱ་བར་སེམས་སུ་ཟད་དེ།
en: If you ask why, Ānanda, to think of the perfection of wisdom being exhausted would simply be to think of space being exhausted.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མ་ཟད་མི་ཟད་ཟད་པར་མི་འགྱུར་རོ། །བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: The perfection of wisdom has not been exhausted, will not be exhausted, and is not being exhausted.

source: བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མ་ཟད་མི་ཟད་ཟད་པར་མི་འགྱུར་རོ། །ནང་སྟོང་པ་ཉིད་དང་།
en: The perfection of meditative concentration, the perfection of perseverance, the perfection of tolerance, the perfection of ethical discipline, and the perfection of generosity have not been exhausted, will not be exhausted, and are not being exhausted.

source: ཕྱི་སྟོང་པ་ཉིད་དང་། ཕྱི་ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ནི་མ་ཟད་མི་ཟད་ཟད་པར་མི་འགྱུར་རོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: The emptiness of internal phenomena, the emptiness of external phenomena, the emptiness of external and internal phenomena, and [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, have not been exhausted, will not be exhausted, and are not being exhausted.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ནི་མ་ཟད་མི་ཟད་ཟད་པར་མི་འགྱུར་རོ།
en: The applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path have not been exhausted, will not be exhausted, and are not being exhausted.

source: །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ནི་མ་ཟད་མི་ཟད་ཟད་པར་མི་འགྱུར་རོ།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, [the serial steps of meditative absorption], emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways have not been exhausted, will not be exhausted, and are not being exhausted.

source: །དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ནི་མ་ཟད་མི་ཟད་ཟད་པར་མི་འགྱུར་རོ།
en: The ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, and the eighteen distinct qualities of the buddhas will not be exhausted and are not being exhausted. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ནི་མ་ཟད་མི་ཟད་ཟད་པར་མི་འགྱུར་རོ།
en: The goals], up to and including all-aspect omniscience, will not be exhausted and are not being exhausted.

source: །ཆོས་དེ་དག་ལ་ནི་སྐྱེ་བ་ཡང་མེད་ན། དེ་དག་ཟད་པར་འགྱུར་བ་ལྟ་ག་ལ་ཡོད།
en: Since all phenomena are indeed nonarising, how could they possibly be exhausted!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་ལྗགས་ཀྱི་དབང་པོ་བཀྲམ་སྟེ།
en: Thereupon the Blessed One stretched out his tongue.

source: ཞལ་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལྗགས་ཀྱི་དབང་པོས་ཡོངས་སུ་བཀབ་ནས། ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་བཀའ་སྩལ་པ། དགའ་བོ་དེ་ཇི་སྙམ་དུ་སེམས། ལྕེའི་དབང་པོ་འདི་ལྟ་བུ་དང་ལྡན་པ་ལོག་པར་སྨྲ་བ་འམ་གཞན་དུ་སྨྲ་བར་འགྱུར་རམ། གསོལ་པ།
en: Covering his entire face with his tongue, he asked the venerable Ānanda, “Ānanda, do you think that one possessing a tongue such as this would speak falsely or would speak otherwise?” “

source: བཅོམ་ལྡན་འདས་མ་ལགས་སོ།
en: No, Blessed Lord!” “

source: །བདེ་བར་གཤེགས་པ་དེ་ནི་མ་ལགས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགའ་བོ་དེ་བས་ན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདི་འཁོར་བཞི་ལ་རྒྱ་ཆེར་སྟོན་ཅིག །རྗོད་ཅིག་སྒྲོགས་ཤིག་ཤོད་ཅིག་ཁོད་ཅིག་རབ་ཏུ་ཁོད་ཅིག །ཁྲོལ་ཅིག་རྣམ་པར་ཕྱེ་ཞིག །
en: Therefore, Ānanda,” continued the Blessed One, “you should extensively teach, declare, proclaim, and explain this perfection of wisdom to the four assemblies, establishing it and thoroughly establishing it!

source: གསལ་བར་གྱིས་ཤིག །ཡང་དག་པར་སྟོན་ཅིག །
en: You should interpret, analyze, elucidate, and genuinely reveal it!

source: དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལས་གང་ལ་ཉན་ཐོས་ཀྱི་ཐེག་པ་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པ་དང་། གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པས་བསླབ་པར་བྱ་བ་དང་། གང་ལ་ཇི་ལྟར་བསྟན་པ་བཞིན་དུ་བསླབས་པས་རང་རང་གི་ས་ལ་གནས་པར་འགྱུར་བའི་ཆོས་ཐམས་ཅད་རྒྱ་ཆེར་བསྟན་ཏེ།
en: It is from this profound perfection of wisdom that all phenomena have been extensively revealed—those phenomena in which the followers of the vehicle of the śrāvakas, the followers of the vehicle of the pratyekabuddhas, and individuals following the vehicle of the bodhisattvas should train, and by training in which, as has been explained, they will dwell on their own respective levels. {

source: དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི་ཡི་གེ་ཐམས་ཅད་ལ་འཇུག་པའོ།
en: Ki.V: 78} “Ānanda, this profound perfection of wisdom is an entrance to all syllables.

source: །དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ནི་གཟུངས་ཀྱི་སྒོ་གང་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་བསླབ་པར་བྱ་བའི་གཟུངས་ཐམས་ཅད་ཀྱི་སྒོ་ཡིན་ཏེ།
en: Ānanda, this profound perfection of wisdom is the gateway of all dhāraṇīs in which bodhisattva great beings should train.

source: གཟུངས་འདི་འཛིན་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ལ་ནི་སྤོབས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པའི་སྒོ་ཐམས་ཅད་མངོན་དུ་འགྱུར་རོ།
en: Bodhisattva great beings who retain these dhāraṇīs will realize all the gateways to inspired eloquence and exact knowledge. “

source: །དགའ་བོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ནི་འདས་པ་དང་། མ་བྱོན་པ་དང་། ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་དམ་པའི་ཆོས་མི་ཟད་པའི་མཛོད་ངས་བཤད་པའོ།
en: Ānanda, I have explained this perfection of wisdom to be the inexhaustible repository of the Dharma of the lord buddhas of the past, future, and present.

source: །དགའ་བོ་དེ་བས་ན་ཁྱོད་ཀྱིས་ཡིད་ཆེས་པ་དང་། ཁོང་དུ་ཆུད་པར་བྱ་སྟེ།
en: Therefore, Ānanda, you should have confidence in it and master it.

source: གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་ནི་འདས་པ་དང་། མ་འོངས་པ་དང་།
en: Those who take up, uphold, recite, and master this profound perfection of wisdom uphold the enlightenment of the lord buddhas of the past, future, and present.

source: ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་བྱང་ཆུབ་འཛིན་པ་ཡིན་ཏེ། དགའ་བོ་ཁྱོད་ཀྱིས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུངས་གང་བཟུང་བས། ཆོས་ཐམས་ཅད་གཟུང་བར་འགྱུར་བའི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པའི་གཟུངས་ངས་བསྟན་པ་ནི་འདི་ཡིན་ནོ།
en: Ānanda, this is the dhāraṇī of the perfection of wisdom that I have taught, and by retaining which you will retain all phenomena.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ལྔ་བཅུ་པའོ།། །།།།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ།
en: This completes the fiftieth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: བམ་པོ་ལྔ་བཅུ་བདུན་པ། །དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་འདི་སྙམ་དུ་འགྱུར་ཏེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཡང་ཟབ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་བྱང་ཆུབ་ཀྱང་ཟབ་ན། བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་དེ་དྲིའོ་སྙམ་སྟེ།
en: Chapter 51 Then the venerable Subhūti thought, “Since the perfection of wisdom is indeed profound, and the enlightenment of the tathāgatas, arhats, completely awakened buddhas is also profound, I should question the tathāgata, arhat, completely awakened Buddha about it.”

source: དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་མི་བས་པའོ།
en: Thereupon the venerable Subhūti said to the Blessed One, “Blessed Lord, the perfection of wisdom is inexhaustible.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ནམ་མཁའ་མི་ཟད་པའི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་ཟད་པའོ།
en: Subhūti, the perfection of wisdom is inexhaustible because space is inexhaustible,” replied the Blessed One. “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བགྱི།
en: Blessed Lord, how should the perfection of wisdom be brought into being?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་གཟུགས་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti,” replied the Blessed One, “the perfection of wisdom should be brought into being through the inexhaustibility of physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: The perfection of wisdom should be brought into being through the inexhaustibility of feelings, perceptions, formative predispositions, and consciousness.

source: །རབ་འབྱོར་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, the perfection of wisdom should be brought into being through the inexhaustibility of the sense fields, the sensory elements, and the links of dependent origination.

source: །རབ་འབྱོར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, the perfection of wisdom should be brought into being through the inexhaustibility of the perfection of generosity.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: The perfection of wisdom should be brought into being through the inexhaustibility of the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: །རབ་འབྱོར་ནང་སྟོང་པ་ཉིད་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, the perfection of wisdom should be brought into being through the inexhaustibility of the emptiness of internal phenomena.

source: །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: The perfection of wisdom should be brought into being through the inexhaustibility of [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: །རབ་འབྱོར་དྲན་པ་ཉེ་བར་གཞག་པ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ། །རབ་འབྱོར་ཡང་དག་པར་སྤོང་བ་དང་།
en: Subhūti, the perfection of wisdom should be brought into being through the inexhaustibility of the applications of mindfulness.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་མི་ཟད་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་མངོན་པར་བསྒྲུབ་པར་བྱའོ།
en: Subhūti, the perfection of wisdom should be brought into being through the inexhaustibility of the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: །རབ་འབྱོར་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་།
en: Subhūti, the perfection of wisdom should be brought into being through the inexhaustibility of the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, {Ki.
